design_model/src/main/resources/生产型模式/建造者模式/建造者模式.md
```mermaid
classDiagram
    class Builder {
        <<Abstract>>
        +void buildPartA()*
        +void buildPartB()*
        +void buildPartC()*
        +void getResult()*
    }
    class ConcreteBuilder {
        +void buildPartA()
        +void buildPartB()
        +void buildPartC()
        +void getResult()
    }
    class Product {
    }
    class Director {
        -Builder builder
        +construct()
    }
    ConcreteBuilder --|> Builder
    ConcreteBuilder ..> Product
    Director ..> Builder
```
